<script setup>
	import { ref } from 'vue';
	// 用于跟踪状态的变量
	const value = ref(1);
</script>

<template>
	<view class="agenda">
		<!-- 头部 -->
		<view class="header">
			<view class="header-content">
				<view class="text" :class="{ 'text1': value === 1 }" @click="value=1">社区规范</view>
				<view class="text" :class="{ 'text1': value === 2 }" @click="value=2">小黑屋</view>
			</view>
		</view>
		<!-- 内容区 -->
		<view class="content" v-show="value === 1">
			<view style="padding: 30rpx;">
				<text space="emsp">  湖汽万能墙致力于为用户提供一个温暖、可信、友善和谐的线上社区。为了维护社区秩序，保持良好氛围，审核同学将依据本规范中的条款对使用 湖汽万能墙 社区的用户和发布与 湖汽万能墙 社区上的内容进行管理。在收到用户举报或巡查发现违规行为时，审核同学将会根据对社区氛围破坏的程度，使用删除发布内容、暂停用户部分权限乃至终止用户使用湖汽万能墙社区的权利等措施进行管理。</text>
				<view class="bold-text">违规行为的界定如下</view>
				<view class="bold-text">1 违反法律法规</view>
				<text>	1.1 反对宪法所确定的基本原则 \n 
						1.2 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统  \n 
						1.3 损害国家荣誉和利益  \n 
						1.4 煽动民族仇恨、民族歧视，破坏民族团结  \n 
						1.5 侮辱、滥用英烈形象，否定英烈事迹，美化粉饰侵略战争行为的  \n 
						1.6 破坏国家宗教政策，宣扬邪教和封建迷信  \n 
						1.7 散布谣言，扰乱社会秩序，破坏社会稳定  \n 
						1.8 宣扬淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪  \n 
						1.9 煽动非法集会、结社、游行、示威、聚众扰乱社会秩序  \n 
						1.10 诽谤他人，泄露他人隐私，侵害他人合法权益  \n 
						1.11 捏造、攻击、嘲讽、戏谑、传播历任及现任党和国家领导人相关敏感信息   \n 
						1.12 出售、传播翻墙相关信息  \n 
						1.13 发布含有法律、行政法规禁止的其他内容的信息1.14 发布上级监管部门禁止的危害平台安全的信息
				</text>
				<view class="bold-text">2 违反校规</view>
				<text>	2.1 发布转课、卖课、有偿交易图书馆座位等  \n  
						2.2 发布征集或者提供代课、代考、代写作业、代签到等作整信息  \n 
						2.3 盗用学校或学校部门、校内组织名义从事活动  \n 
						2.4 其他通过校友圈组织、参与、宣扬的违反校规的行为
				</text>
				<view class="bold-text">3 违反发帖要求</view>
				<text>	3.1发布帖子时未按照该分类的发帖要求提供必要信息  \n
				3.2 发布求助类帖子时违反自查要求  \n
				3.3 发布闲置类帖子时违反自查要求\n
				3.3.1 发布的闲置价格高于原购入价格\n
				3.3.2 发布的闲置价格高于在其他平台的挂价\n
				3.3.3 发布不符合国家相关法律和社区规定类别的闲置\n
				3.3.4 发布闲置时将书籍资料、仙女集市(美妆护肤)、鞋服包饰等展示受限分类混入其他分类  \n
				3.4 发布寻人类帖子时未说明来意或侵犯他人隐私  \n
				3.5 发布帖子时错误分类或回避展示受限的分类  \n
				3.6 七天之内以同一账号、不同账号或跟帖等任意形式重复发布帖子(寻物招领类除外)\n
				3.7 宠物领养只允许无偿领养，禁止商家机构或个人进行宠物销售行为</text>
				<view class="bold-text">4 不友善的行为</view>
				<text>	4.1 轻蔑:贬低、车轻视他人及其劳动成果\n
						4.2 诽谤:捍造、散布虚假事实，损害他人名誉\n
						4.3 嘲讽:以比喻、夸张、侮辱性的手法对他人或其行为进行揭露或描述，以此来激怒他人\n
						4.4 挑衅:以不友好的方式激怒他人，意图使对方对自己的言论作出回应，蓄意制造事端\n
						4.5 羞辱:贬低他人的能力、行为、生理或身份特征，让对方难琪\n
						4.6 谩骂:以不文明的语言对他人进行负面评价\n
						4.7 歧视:针对他人的民族、种族、宗教、性取向、性别、年龄、地域、生理特征、疾病、专业等身份或者归类的攻必\n
						4.8 威胁:许诺以不良的后果来迫使他人服从自己的意志\n
						4.9 欺诈:通过编造身份或事实，谋取利益、引发混乱或哗众取宠
				</text>
				<view class="bold-text">5 发布垃圾信息、广告信息</view>
				<text>	5.1 以商家、机构、微商、代理、代购、中介、黄牛等任何商业身份发布牟利或推广信息\n
						5.2 以所谓出售闲置为名义的牟利行为5.2.1 出售可轻易免费领取的物品、票卡或资格\n
						5.3 有组织地以软文发布售卖产品、提供服务、宣传推广等内容的垃圾广告\n
						5.3.1 以消费者或用户等身份发布的软文钓鱼帖\n
						5.4 发布诱导用户点击、分享、点赞、集赞、评论、跳转、关注的引流营销内容\n
						5.5 发布含有返利内容的推广链接、二维码等内容，返利范围包括金钱、积分、资格等\n
						5.6 发布非校内相关的活动信息\n
						5.7 通过快速发帖、回帖、发布无意义图文等行为干扰社区秩序和用户体验\n
						5.8 频繁回复过早时期的帖文，对他人造成千扰\n
						5.9 频繁私聊骚扰他人，干扰社区秩序\n
						5.10 发布诸如投票、助力、加速、砍价、测试、点赞等病毒营销类信息\n
						5.11 发布饭圈、性别对立等经典对立话题
				</text>
				<view class="bold-text">6 发布色情低俗信息</view>
				<text>	6.1 发布、索取、传播漏点图、性行为、性交易等相关色情图文、视频、网址等信息\n
						6.2 发布约炮或相关性暗示等违规交友内容\n
						6.2.1 非匿名状态下表达交友、恋爱等需求或倾向，但无明确要求足够信息，视作性暗示处理\n
						6.2.2 描述约炮、性虐待、性交易等经历或经验，视作性暗示处理\n
						6.3 发布细致描绘性行为或露骨自拍的内容\n
						6.4 发布血腥、恶俗、恐怖、自残等令人感到不适的低俗内容\n
						6.5 在匿名模式下交友，索取或暴露联系方式\n
						6.5.1在匿名下交友，但采取捞人等方式规避匿名留联系方式
				</text>
				<view class="bold-text">7 被禁止的违规闲置类别</view>
				<text>	7.1 枪支弹药、管制刀具、易燃易爆品、毒品\n
						7.2 招嫖信息、原味衣物、烟草、电子烟\n
						7.3 发票、假证、假章、假冒商品、盗版内容、宠物、翻墙软件及服务\n
						7.4 试卷、作业、电子资料
				</text>
				<view class="bold-text">用户违反社区规范后的处理</view>
				<text>	视危害大小与违规次数的不同，用户违规后被禁言的时长也不同。当用户被一定数量的用户举报，会被临时封禁 1天，审核团队会根据用户行为选择解封或者进行正式的封禁操作。\n
						一般除违反发帖要求以外的违规行为，起始封禁时长为7或 30 天，高度政治敏感和恶劣商业行为 360 天起。\n
						所有同类违规行为累犯时，封禁时长增加一级，封禁时长共6档:1天，3天，7天，30天，360天，永久封禁。大部分违规行为后的起始封禁等级集中在2级和4级，政治敏感和色情信息及其他恶性行为的起始封禁等级为5级。\n
						如果用户发帖子 or 发评论时，由于言论不当，最后造成恶劣影响或违法违规，管理团队将会积极配合相关部门进行调查取证。</text>
				<view class="bold-text">最后</view>
				<text style="font-weight: 540;">湖汽校园墙还在发展，受人力所限，对于社区的管理无法做到尽善尽美。我们十分欢迎每一位同学的监督，善用举报功能，共同建设和谐友善的社区氛围。湖汽校园墙对以上内容保留最终解释权。</text>
			</view>
		</view>
		
		<view v-show="value === 2" style="height: 100vh; text-align: center; line-height: 100vh; color: rgb(182, 182, 182);">正在开发当中，敬请期待</view>
		<!-- 尾部 -->
		<view class="footer">
			<view>湖汽校园墙@2024</view>
		</view>
	</view>
</template>

<style lang="scss">
	.agenda {
		height: 100%;
		background-color: rgb(242, 246, 249);
		// 头部
		.header{
			background-color: rgb(255, 255, 255);
			height: 13vh; 
			display: flex;
			justify-content: center;
			align-items: center;
			.header-content{
				background-color: rgb(238, 238, 238);
				height: 6vh;
				width: 60vw;
				display: flex;
				justify-content: space-around;
				align-items: center;
				border-radius: 10rpx; // 添加圆角
				.text{
					font-size: 3vw;
					width: 28vw;
					height: 5vh;
					border-radius: 10rpx; // 添加圆角
					text-align: center; // 水平居中
					line-height: 5vh; // 设置行高为高度，垂直居中
					transition: background-color 0.6s ease;
				}
				.text1{
					background-color: rgb(255, 255, 255);
				}
			}
		}
		// 内容区
		.content{
			background-color: rgb(255, 255, 255);
			margin: 20rpx;
			// 设置字体加粗
			.bold-text{
				font-weight: bold; /* 设置字体加粗 */
				padding-top: 30rpx;
			}
			text{
				font-size: 3.5vw;
			}
		}
		// 尾部
		.footer{
			display: flex;
			justify-content: center;
			padding: 40rpx 0;
			color: rgb(192, 196, 204);
		}
	}
</style>